{
  "app": {
    "name": "Uify",
    "short_description": "Build custom Zendesk apps, powered by AI and integrated with your systems.",
    "long_description": "Uify is a flexible low-code platform to build custom Zendesk apps fast. As a developer or a Zendesk administrator, you'll find Uify to help you rapidly build AI-powered solutions, fully integrated with your other systems and data sources to accelerate your agents.\n\n**Drag-and-Drop UI Builder:** Uify's library of UI components is specifically optimized for the side panel dimensions. Simply drag and drop to construct a user-friendly interface, no need to develop from scratch.\n\n**Wide Array of Integrations:** Connect your CRM system, various database types, data warehouses, REST APIs, and different AI model. So, your users can your systems without leaving Zendesk to complete their tasks. A full list of currently available integrations can be found [here](https://uify.io/integrations?utm_source=zendesk_marketplace).\n\n**AI-Powered Interactions:** Uify is not just about integrations but intelligent interactions. With our library of prompt templates, you can easily extract structured data from your Zendesk tickets to make reliable function calls, build agents that can interact with your connected integrations or just support your users in drafting responses enriched with data from your internal systems.\n\n**JavaScript Anywhere:** Freely use JavaScript anywhere in your Zendesk app to express custom logic. If customization is your game, Uify is the name.\n\n**Context-Aware:** Utilizing the Zendesk Software Development Kit (SDK), all Uify apps are context-aware - they can access the current ticket and state of Zendesk at all times.\n\n**Built-In Roles & Permissions:** Set granular app permissions for different users effortlessly. Uify’s roles and permissions system takes care of the complexities so you don’t have to.\n\n**Version Management:** Stay in control with Uify's version management, keeping track of every changes to your application and being able to roll back to previous versions.\n\nBridge the gap between your systems and your agents. Accelerate response time and quality. Uify supports you with flexible and innovative solutions that are fast to deploy. Build your next Zendesk app with a tool that not only meets but anticipates your requirements.\n\n[Get started](https://uify.io/?utm_source=zendesk_marketplace) with one of our customizable templates and learn how to build Zendesk apps with Uify today!",
    "installation_instructions": "To use your custom-built Uify apps in Zendesk Support, you first need to sign-up for a [Uify workspace](https://app.uify.io/signup?utm_source=zendesk_marketplace).\n\nAfter you have created your workspace, you can build your first app. Uify is a low-code platform, so you can use ready-made UI components and customize them to your liking. You can integrate with your internal systems and use custom code to define the application logic. Note: To access the context of your current Zendesk ticket, you can need to use `integrations.zendesk` to access the client.\n\n### Getting Started: \n1. Sign in to your Zendesk Support account, then click **Admin center** in the navigation bar. \n2. Under **Apps and integrations** select **Zendesk Support apps**. \n3. Click on **Marketplace**, find **Uify** and click on **Install**. \n4. On the installation page, provide the **App id** of the Uify app you want to be displayed in your sidebar. \n5. Click **Install**.\n\nOnce installed, refresh your page and the Uify app whose id you provided, should appear in the sidebar. If you are already signed in to Uify in the same browser, we'll pick up on the crendentials. If not, you'll have to enter your email and password or, if enabled, sign in via SSO.",
    "parameters": {
      "appId": {
        "label": "App id",
        "helpText": "Go to your [Uify workspace](https://app.uify.io/) and open the app you want to embed. The id can be found in your apps url and has the following format xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx."
      },
      "height": {
        "label": "Height",
        "helpText": "You can set the height of your app. Will default to 600px."
      }
    }
  }
}